[NoCoverage] Negate expression
ActionDispose.cs:27:17
         private T1 _Arg1;
 
         public ActionDispose(Action<T1> onDispose, T1 arg1) {
-            if (this._OnDispose is object) {
+            if (!(this._OnDispose is object)) {
                 this._OnDispose = onDispose;
                 this._Arg1 = arg1;

[NoCoverage] Negate expression
ActionDispose.cs:35:17
 
         protected override void Dispose(bool disposing) {
             var onDispose = System.Threading.Interlocked.Exchange(ref _OnDispose, null);
-            if (onDispose is object) {
+            if (!(onDispose is object)) {
                 var arg1 = this._Arg1;
                 this._Arg1 = default;
