[NoCoverage] Negate expression
ContainingDisposable.cs:19:17
         }
 
         protected void SetResource(T resource) {
-            if (ReferenceEquals(this._Resource, resource)) { 
+            if (!(ReferenceEquals(this._Resource, resource))) { 
                 return; 
             }

[NoCoverage] Negate expression
ContainingDisposable.cs:23:17
                 return; 
             }
             bool wasFinalizeRegistered;
-            if (this._Resource is object) {
+            if (!(this._Resource is object)) {
                 using (var r = this._Resource) {
                     this._Resource = null;

[NoCoverage] Boolean mutation
ContainingDisposable.cs:27:41
                 using (var r = this._Resource) {
                     this._Resource = null;
                 }
-                wasFinalizeRegistered = true;
+                wasFinalizeRegistered = false;
             } else {
                 wasFinalizeRegistered = false;

[NoCoverage] Boolean mutation
ContainingDisposable.cs:29:41
                 }
                 wasFinalizeRegistered = true;
             } else {
-                wasFinalizeRegistered = false;
+                wasFinalizeRegistered = true;
             }
 

[NoCoverage] Negate expression
ContainingDisposable.cs:33:21
             }
 
             if (resource is null) {
-                if (wasFinalizeRegistered) {
+                if (!(wasFinalizeRegistered)) {
                     System.GC.SuppressFinalize(this);
                 }

[NoCoverage] Negate expression
ContainingDisposable.cs:38:21
                 }
             } else {
                 this._Resource = resource;
-                if (!wasFinalizeRegistered) {
+                if (!(!wasFinalizeRegistered)) {
                     System.GC.ReRegisterForFinalize(this);
                 }

[NoCoverage] LogicalNotExpression to un-LogicalNotExpression mutation
ContainingDisposable.cs:38:21
                 }
             } else {
                 this._Resource = resource;
-                if (!wasFinalizeRegistered) {
+                if (wasFinalizeRegistered) {
                     System.GC.ReRegisterForFinalize(this);
                 }
