[Survived] Negate expression
TracedDisposable.cs:6:17
         private readonly string _CtorStackTrace;
 
         public TracedDisposable() {
-            if (TracedDisposableControl.Instance.IsTraceEnabled(this.GetType())) {
+            if (!(TracedDisposableControl.Instance.IsTraceEnabled(this.GetType()))) {
                 this._CtorStackTrace = TracedDisposableControl.GetStackTrace();
             }

[Survived] Boolean mutation
TracedDisposable.cs:23:37
                     });
             } catch {
             }
-            this.Dispose(disposing: false);
+            this.Dispose(disposing: true);
         }
 

[NoCoverage] Boolean mutation
TracedDisposable.cs:27:37
         }
 
         public void Dispose() {
-            this.Dispose(disposing: true);
+            this.Dispose(disposing: false);
             System.GC.SuppressFinalize(this);
         }
