[Killed] Boolean mutation
TracedDisposableControl.cs:11:46
         private static TracedDisposableControl _Instance;
         public static TracedDisposableControl Instance => _Instance ?? (_Instance = new TracedDisposableControl());
 
-        private bool _IsTraceEnabledForAll = false;
+        private bool _IsTraceEnabledForAll = true;
         private Dictionary<Type, bool> _IsTraceEnabledForType;
 

[Killed] Boolean mutation
TracedDisposableControl.cs:20:20
 
         public void SetTraceEnabledForType(System.Type type, bool value) {
             //for(int watchdog = 1000; watchdog > 0; watchdog--) {
-            while (true) {
+            while (false) {
                 Dictionary<Type, bool> oldDict = this._IsTraceEnabledForType;
                 Dictionary<Type, bool> nextDict

[Killed] Negate expression
TracedDisposableControl.cs:20:20
 
         public void SetTraceEnabledForType(System.Type type, bool value) {
             //for(int watchdog = 1000; watchdog > 0; watchdog--) {
-            while (true) {
+            while (!(true)) {
                 Dictionary<Type, bool> oldDict = this._IsTraceEnabledForType;
                 Dictionary<Type, bool> nextDict

[Killed] Negate expression
TracedDisposableControl.cs:23:23
             while (true) {
                 Dictionary<Type, bool> oldDict = this._IsTraceEnabledForType;
                 Dictionary<Type, bool> nextDict
-                    = (this._IsTraceEnabledForType is null)
+                    = !((this._IsTraceEnabledForType is null)
+)
                     ? new Dictionary<Type, bool>()
                     : new Dictionary<Type, bool>(oldDict);

[Timeout] Negate expression
TracedDisposableControl.cs:28:21
                     : new Dictionary<Type, bool>(oldDict);
                 nextDict[type] = value;
                 var prevDict = System.Threading.Interlocked.CompareExchange(ref this._IsTraceEnabledForType, nextDict, oldDict);
-                if (ReferenceEquals(prevDict, oldDict)) {
+                if (!(ReferenceEquals(prevDict, oldDict))) {
                     return;
                 }

[Killed] Negate expression
TracedDisposableControl.cs:35:17
         }
 
         public bool IsTraceEnabled(System.Type type) {
-            if (this._IsTraceEnabledForAll) { return true; }
+            if (!(this._IsTraceEnabledForAll)) { return true; }
             var dict = this._IsTraceEnabledForType;
             if (type is object && dict is object) {

[Killed] Boolean mutation
TracedDisposableControl.cs:35:54
         }
 
         public bool IsTraceEnabled(System.Type type) {
-            if (this._IsTraceEnabledForAll) { return true; }
+            if (this._IsTraceEnabledForAll) { return false; }
             var dict = this._IsTraceEnabledForType;
             if (type is object && dict is object) {

[Killed] Negate expression
TracedDisposableControl.cs:37:17
         public bool IsTraceEnabled(System.Type type) {
             if (this._IsTraceEnabledForAll) { return true; }
             var dict = this._IsTraceEnabledForType;
-            if (type is object && dict is object) {
+            if (!(type is object && dict is object)) {
                 if (dict.TryGetValue(type, out var result)) {
                     return result;

[Killed] Logical mutation
TracedDisposableControl.cs:37:17
         public bool IsTraceEnabled(System.Type type) {
             if (this._IsTraceEnabledForAll) { return true; }
             var dict = this._IsTraceEnabledForType;
-            if (type is object && dict is object) {
+            if (type is object || dict is object) {
                 if (dict.TryGetValue(type, out var result)) {
                     return result;

[Killed] Equality mutation
TracedDisposableControl.cs:62:21
 
         public void ReportFinalized(ReportFinalizedInfo reportFinalizedInfo) {
             try {
-                if (this.CurrentReportFinalized != null) {
+                if (this.CurrentReportFinalized == null) {
                     this.CurrentReportFinalized(reportFinalizedInfo);
                 }

[Killed] Negate expression
TracedDisposableControl.cs:62:21
 
         public void ReportFinalized(ReportFinalizedInfo reportFinalizedInfo) {
             try {
-                if (this.CurrentReportFinalized != null) {
+                if (!(this.CurrentReportFinalized != null)) {
                     this.CurrentReportFinalized(reportFinalizedInfo);
                 }

[Killed] Boolean mutation
TracedDisposableControl.cs:72:44
         public static string GetStackTrace() {
             var sb = new StringBuilder();
             try {
-                var st = new StackTrace(1, true);
+                var st = new StackTrace(1, false);
                 var frames = st.GetFrames();
                 foreach (var frame in frames) {

[Killed] String mutation
TracedDisposableControl.cs:89:32
                         columnNumber = frame.GetFileColumnNumber();
                     } catch { }
                     sb.Append(declaringTypeName).Append(".").Append(methodName)
-                       .Append(" fileName:").Append(fileName).Append("@").Append(lineNumber).Append(":").Append(columnNumber)
+                       .Append("").Append(fileName).Append("@").Append(lineNumber).Append(":").Append(columnNumber)
                        .AppendLine();
                 }

[NoCoverage] String mutation
TracedDisposableControl.cs:94:27
                 }
                 return sb.ToString();
             } catch {
-                sb.Append("??").AppendLine();
+                sb.Append("").AppendLine();
                 return sb.ToString();
             }
